writing/investigations-into-cell-complex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-22 Fri 03:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Investigations into Cell Complex</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Investigations into Cell Complex</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org30ad1ce"><span class="done _note_">[note]</span> </a></li>
<li><a href="#org65134e7">Abstract</a></li>
<li><a href="#orgf5b5bb4">References</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>Author : Xie Yuheng</p></li>
<li><p>Date : Started at 2019-03-22, WIP</p></li>
<li><p>Keywords : CW complex, Cell complex, Algebraic Topology, Aristotle.</p></li></ul>

<div id="outline-container-org30ad1ce" class="outline-2">
<h2 id="org30ad1ce"><span class="done _note_">[note]</span> </h2>
<div class="outline-text-2" id="text-org30ad1ce">
<ul class="org-ul">
<li><p>Just like Aristotle, I start by history reviews and critiques.</p></li>

<li><p><p></p><p>The axioms of topological space</p><p>is motivated by the arithmetization of infinitesimal analysis {<a href="#orgaa2a5a0">1</a>}.</p><p></p></p><p></p><p><p></p><p>The axioms thus developed, capture the concept of nearness,</p><p>the first impressive use of the axioms</p><p>is the definition of continuity.</p><p></p></p></li>

<li><p>Based on cell complex, I show another list of axioms,</p><p>to capture the concept of connectedness first,</p><p>and firstly use it to give</p><p>an alternative definition of continuity.</p></li>

<li><p>This approach can be traced back to Aristotle,</p><p>in part six of his "Categories".</p></li>

<li><p><p></p><p>The aim of Algebraic topology is to develop functors</p><p>to distinguish topological spaces.</p><p></p></p><p></p><p><p></p><p>The functors developed often approach this aim</p><p>by expressing connectedness.</p><p></p></p><p></p><p><p></p><p>Thus my design is practical for algebraic topology.</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org65134e7" class="outline-2">
<h2 id="org65134e7">Abstract</h2>
</div>

<div id="outline-container-orgf5b5bb4" class="outline-2">
<h2 id="orgf5b5bb4">References</h2>
<div class="outline-text-2" id="text-orgf5b5bb4">
<ul class="org-ul">
<li><p><a id="orgaa2a5a0"></a></p><p>Arithmetization of Analysis, on Wikipedia</p><p><a href="https://en.wikipedia.org/wiki/Arithmetization_of_analysis">https://en.wikipedia.org/wiki/Arithmetization_of_analysis</a></p></li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-03-22 Fri 03:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
